#define _CRT_SECURE_NO_WARNINGS 1
//数组--创建一个空间来存放一组数
//定义--一组相同类型元素的集合
#include<stdio.h>
#include<string.h>

//int main()
//{
//	//int a = 1;
//	//int b = 2;
//	//int c = 3;
//	//int d = 4;
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,0 };//定义一个存放10个整形数字的数组
//	//数组全部表现出来，0-9的下标
//	int i = 0;
//	while (i < 10)
//	{
//		printf("%d ", arr[i]);
//		i++;
//	}
//	//规定的{}中的元素都有下标 0,1,2,3,4,5,6,7,8,9
//	//下标是从0开始，依次递增1，若数组有n个元素，则下标至n-1
//	//printf("%d\n", arr[4]);//用下标的方式访问元素
//	//arr[下标]
//	//char ch[20];
//	//float arr2[5];
//	return 0;
//}

//操作符
int main()
{
	//算术操作符
	//int a = 5 / 2;//2--商
	//int b = 5 % 2;//取模、取余数  5模2余1--取余数
	//printf("%d\n", a);
	//printf("%d\n", b);

	////移（2进制位）位操作符
	////<< 左移操作符
	////>>右移操作符
	//int a = 1;
	////整形1占四个字节-32bit位
	////00000000000000000000000000000001
	//int b=a << 1;
	////00000000000000000000000000000010
	//printf("%d\n", b);
	//printf("%d\n", a);

	//(2进制）位操作
	//&--按位与
	//|--按位或
	//^--按位异或
	//int a = 3;
	//int b = 5;
	//int c = a & b;
	//011
	//101
	//001
	//0为假，1为真，同真为真，按位与则为真-1
	//int a = 3;
	//int b = 5;
	//int c = a|b;
	//011
	//101
	//111
	//按位或，其为1则为1
	//int a = 3;
	//int b = 5;
	//int c = a ^ b;//^--不是次方，是异或
	//异或的计算规律
	//对应的二进制位相同，则为0
	//对应的二进制位相异，贼为1
	//011
	//101
	//110
	//printf("%d\n", c);

	//赋值操作符
	//int a = 10;//=赋值    ==判断相等
	//a = a + 10;
	//a += 10;
	////以上两个方法完全等价
	//a = a - 20;
	//a -= 20;
	//a = a & 2;
	//a &= 2;
	////复合赋值符
	////+= -= *= /= %= >>= <<= |= ^=

	//单位操作符
	//双目操作符
	//三目操作符
	//int a = 10;
	//int b = 20;
	//a + b;//+使用左右两边有两个操作符 故+叫 双目操作符
	//int a = 0;
	//printf("%d\n", a);
	//printf("%d\n", !a);//!,真变假，假变真
	//int a = -2;
	//int b = -a;//+会省略，-取负
	//int a = 10;
	////sizeof 计算的是变量/类型所占空间的大小，单位是字节
	//printf("%d\n", sizeof(a));//4
	//printf("%d\n", sizeof(int));//4
	//printf("%d\n", sizeof a);//4
	////printf("%d\n", sizeof int);//类型不能省略（）
	int arr[10] = { 0 };//10个整形元素的数组
	int sz = 0;
	//10*sizeof(int)=40
	printf("%d\n", sizeof(arr));
	//计算数组的元素个数 
	//数组总大小/每个元素的大小
	sz = sizeof(arr) / sizeof(arr[0]);
	printf("sz=%d\n", sz);
	return 0;
}
